doc/html/elements/link.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Link Element Element</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Link Element Element"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-10-18 03:25:13 CDT"/>
<meta name="author" content="Rusty Klophaus (@rustyio)"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<LINK href='../stylesheet.css' rel='stylesheet' type='text/css' />

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Link Element Element</h1>

<p><a href="../index.html">Getting Started</a> | <a href="../api.html">API</a> | <a href="../elements.html"><b>Elements</b></a> | <a href="../actions.html">Actions</a> | <a href="../validators.html">Validators</a> | <a href="../handlers.html">Handlers</a> | <a href="../config.html">Configuration Options</a> | <a href="../about.html">About</a>
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Link Element - #link{}</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Link Element - #link{}</h2>
<div class="outline-text-2" id="text-1">


<p>
  The link element produces a clickable hyperlink. Depending on its settings,  
  the link can either function as a normal client-side hyperlink, or can
  cause a Nitrogen postback.
</p>

</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3"></span> Usage</h3>
<div class="outline-text-3" id="text-1-1">





<pre class="src src-erlang">#<span class="org-type">link</span> { text=<span class="org-string">"Example Hyperlink"</span>, url=<span class="org-string">"http://nitrogenproject.com"</span> },
</pre>



<pre class="src src-erlang">#<span class="org-type">link</span> { text=<span class="org-string">"Example Postback Link"</span>, postback=link_clicked }
</pre>



<pre class="src src-erlang">#<span class="org-type">link</span> { body=#<span class="org-type">image</span> { image=<span class="org-string">"path/to/image.gif"</span> }, postback=link_clicked}
</pre>


</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3"></span> Attributes</h3>
<div class="outline-text-3" id="text-1-2">


<dl>
<dt>text - (<i>string</i>)</dt><dd>The text to display.

</dd>
<dt>body - (<i>Nitrogen elements</i>)</dt><dd>Instead of text, specify one or more Nitrogen elements (such as an #image) to wrap in a link.

</dd>
<dt>html_encode - (<i>boolean</i>)</dt><dd>Set to true to safely html-encode the link's title.

</dd>
<dt>url - (<i>string</i>)</dt><dd>If set, clicking on the link will navigate to this URL.

</dd>
<dt>new - (<i>boolean</i>)</dt><dd>Set to true to make link open in a new window.

</dd>
<dt>postback - (<i>Erlang term</i>)</dt><dd>If set, clicking on the link will cause a Nitrogen postback with the supplied term.

</dd>
<dt>mobile<sub>target</sub> - (<i>Boolean</i>)</dt><dd>If set to false, this will work with jQuery Mobile to ensure that it skips using jQuery Mobile's automatic page transition loading system.

</dd>
<dt>mobile<sub>dialog</sub> - (<i>Boolean</i>)</dt><dd>If set to true, this will work with jQuery mobile to load the target URL in a <a href="http://jquerymobile.com/demos/1.1.1/docs/pages/page-dialogs.html">jQuery Mobile Dialog</a>.
</dd>
</dl>


</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3"></span> See Also</h3>
<div class="outline-text-3" id="text-1-3">


<ul>
<li><a href="./base.html">base element</a>

</li>
<li><a href="./button.html">button element</a>

</li>
<li><a href="../jquery_mobile_integration.html">jQuery Mobile Integration Guide</a>
</li>
</ul>

</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-10-18 03:25:13 CDT</p>
<p class="author">Author: Rusty Klophaus (@rustyio)</p>
<p class="creator">Org version 7.8.02 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div><h2>Comments</h2>
<b>Note:</b><!-- Disqus does not currently support Erlang for its syntax highlighting, so t-->To specify <!--Erlang--> code blocks, just use the generic code block syntax: <pre><b>&lt;pre&gt;&lt;code&gt;your code here&lt;/code&gt;&lt;/pre&gt;</b></pre>
<br />
<br />
<div id="disqus_thread"></div>
<script type="text/javascript">
	/* * * CONFIGURATION VARIABLES: EDIT BEFORE PASTING INTO YOUR WEBPAGE * * */
	var disqus_shortname = 'nitrogenproject'; // required: replace example with your forum shortname
	var disqus_identifier = 'html/elements/link.html'; //This will be replaced with the path part of the url

	/* * * DON'T EDIT BELOW THIS LINE * * */
	(function() {
		var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
		dsq.src = 'http://' + disqus_shortname + '.disqus.com/embed.js';
		(document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
	})();
</script>
<noscript>Please enable JavaScript to view the <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
<a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>
</body>
</html>
